#例題３
import numpy as np
import matplotlib.pyplot as plt

#身長と体重のベクトルデータを正規乱数で作成
h_wage = np.array( [879,882,865,956,953,1041,1040,859,877,861,858,866,877])
p_density = np.array( [478.4,308.1,310.1,1913.4,1206.5,6168.7,3777.7,183.1,251,275.7,187.7,187,154.8] )
#print( f"身長 {sintyou}")    #for debug
#print( f"体重 {taijyuu}")    #for debug

#相関行列(Correlation Matrix) cm を求める

#相関行列の0行1列から相関係数をｒを代入

#2次式の回帰曲線の係数、a,b,cを計算

#回帰直線の方程式を表示

#回帰直線の座標データを作成
#xの値は，x軸の最小値と最大値

#ｙの値は，回帰直線に合わせて算出


#グラフタイトルに相関係数を表示する

#x軸とy軸のラベルを設定する

#散布図のパラメータを設定する

#回帰直線のグラフ表示

#グラフ表示/出力


